tranminhhuu/KLTN_Source_Git/nrf5SDKforMeshv310src/examples/light_switch/server/src/main.c
/* Copyright (c) 2010 - 2018, Nordic Semiconductor ASA
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without modification,
 * are permitted provided that the following conditions are met:
 *
 * 1. Redistributions of source code must retain the above copyright notice, this
 * list of conditions and the following disclaimer.
 *
 * 2. Redistributions in binary form, except as embedded into a Nordic
 *    Semiconductor ASA integrated circuit in a product or a software update for
 *    such product, must reproduce the above copyright notice, this list of
 *    conditions and the following disclaimer in the documentation and/or other
 *    materials provided with the distribution.
 *
 * 3. Neither the name of Nordic Semiconductor ASA nor the names of its
 *    contributors may be used to endorse or promote products derived from this
 *    software without specific prior written permission.
 *
 * 4. This software, with or without modification, must only be used with a
 *    Nordic Semiconductor ASA integrated circuit.
 *
 * 5. Any software provided in binary form under this license must not be reverse
 *    engineered, decompiled, modified and/or disassembled.
*
 * THIS SOFTWARE IS PROVIDED BY NORDIC SEMICONDUCTOR ASA "AS IS" AND ANY EXPRESS
 * OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
 * OF MERCHANTABILITY, NONINFRINGEMENT, AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL NORDIC SEMICONDUCTOR ASA OR CONTRIBUTORS BE
 * LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
 * CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE
 * GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
 * HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
 * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT
 * OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */

#include <stdint.h>
#include <string.h>
#include "app_simple_timer.h"

/* HAL */
#include "boards.h"
#include "simple_hal.h"
#include "app_timer.h"

/* Core */
#include "nrf_mesh_config_core.h"
#include "nrf_mesh_gatt.h"
#include "nrf_mesh_configure.h"
#include "nrf_mesh.h"
#include "mesh_stack.h"
#include "device_state_manager.h"
#include "access_config.h"
#include "proxy.h"

/* Provisioning and configuration */
#include "mesh_provisionee.h"
#include "mesh_app_utils.h"

/* Models */
#include "generic_onoff_server.h"
#include "generic_onoff_client.h"
/* Logging and RTT */
#include "log.h"
#include "rtt_input.h"

/* Example specific includes */
#include "app_config.h"
#include "example_common.h"
#include "nrf_mesh_config_examples.h"
#include "light_switch_example_common.h"
#include "app_onoff.h"
#include "ble_softdevice_support.h"
#include "nrfx_gpiote.h"
#include "nrf_drv_gpiote.h"
#include "nrf_delay.h"
#include "nrf_log.h"
#include "nrf_log_ctrl.h"
#include "tqt_uart.h"

//tqt edit
#include "app_scheduler.h"
#include <string.h>
#define NODE_PROVISIONED              (LED_3)
#define REQUEST_FROM_CLOUD            (LED_4)
//tqt edit
static int16_t tqt_count_package = 1;
#define STATE_OF_SERVER_LOCK          (LED_1)
static bool current_state = false;
static bool tqt_last_state = false;
#define APP_SCHED_EVENT_SIZE                16                                                    /**< Maximum size of scheduler events. */
#define APP_SCHED_QUEUE_SIZE                192  
                                                 /**< Maximum number of events in the scheduler queue. */
#define PIN_TIMER                                                 APP_TIMER_TICKS(75)
static bool m_device_provisioned;
static bool message_from_remote = false;
static bool get_new_message_from_remote = false;
static bool message_from_cloud = false;
static bool get_new_message_from_cloud = false;
#define TQT_NEW_MODEL_1          (1)
#define TQT_NEW_MODEL_2          (2)
#define TQT_CONFIG_SERVER_NODE_RELAY          (1)
#define TQT_CONFIG_SERVER_NODE_LOCK           (2)
//#define TQT_CONFIG_SERVER_ROLE                (TQT_CONFIG_SERVER_NODE_RELAY)
#define TQT_CONFIG_SERVER_ROLE                (TQT_CONFIG_SERVER_NODE_LOCK)
// Adding Keypad S
char input_pass[5]=""; 
static char pin_key_map[4][4] ={{0x41,0x42,0x43,0x44},
                               {0x03,0x06,0x09,'#'},
                               {0x02,0x05,0x08,0x00},
                               {0x01,0x04,0x07,'*'}};
//static char pin_key_map[4][4] ={{'A','B','C','D'},
//                               {'3','6','9','#'},
//                               {'2','5','8','0'},
//                               {'1','4','7','*'}};
static uint8_t pin_check=0;
static int countKey=0;
//char pass[]="0206\0";
char pass[] = {0x00,0x02,0x00,0x06,'\0'};
int Keypad_on = 0;
APP_TIMER_DEF(pin);
int input_done = 0;
// Adding Keypad E
//tqt edit 12032019 start      
#define TQT_SERVER_MODEL_LISTEN_MESH_STATUS_INDEX   (3)
static void app_onoff_server_set_cb(const app_onoff_server_t * p_server, bool onoff);
static void app_onoff_server_get_cb(const app_onoff_server_t * p_server, bool * p_present_onoff);

APP_ONOFF_SERVER_DEF(server_model_listen_cloud_mesh_stt,
                     APP_CONFIG_FORCE_SEGMENTATION,
                     APP_CONFIG_MIC_SIZE,
                     app_onoff_server_set_cb,
                     app_onoff_server_get_cb)
static void app_onoff_server_set_cb(const app_onoff_server_t * p_server, bool onoff)
{
    __LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "Receive Mesh NetWork Request");
    app_onoff_status_publish(&server_model_listen_cloud_mesh_stt);
}

static void app_onoff_server_get_cb(const app_onoff_server_t * p_server, bool * p_present_onoff)
{
    __LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "Get cb");
    //*p_present_onoff = hal_led_pin_get(LOCK_STATUS);
}

//tqt edit 12032019 end


static void app_onoff_server0_set_cb(const app_onoff_server_t * p_server, bool onoff);                 
static void app_onoff_server0_get_cb(const app_onoff_server_t * p_server, bool * p_present_onoff);     
/* Generic OnOff server structure definition and initialization */
APP_ONOFF_SERVER_DEF(m_onoff_server_0,                        
                     APP_CONFIG_FORCE_SEGMENTATION,
                     APP_CONFIG_MIC_SIZE,
                     app_onoff_server0_set_cb,
                     app_onoff_server0_get_cb)

