tranminhhuu/KLTN_Source_Git/nrf5SDKforMeshv310src/examples/light_switch/server/src/main.c
void tqt_send_state_to_provisioner(bool state) {
            //__LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "STATE TO PROVISIONER: %d\n",state);
            uint32_t status = NRF_SUCCESS;
            generic_onoff_set_params_t set_params;
            model_transition_t transition_params;
            static uint8_t tid = 0;
            set_params.on_off = state;
            set_params.tid = tid++;
            transition_params.delay_ms = TQT_APP_CONFIG_ONOFF_DELAY_MS;
            transition_params.transition_time_ms = TQT_APP_CONFIG_ONOFF_TRANSITION_TIME_MS;
            
            (void)access_model_reliable_cancel(tqt_m_client.model_handle);
            status = generic_onoff_client_set(&tqt_m_client, &set_params, &transition_params); 
            switch (status)
            {
                case NRF_SUCCESS:
                    break;

                case NRF_ERROR_NO_MEM:
                case NRF_ERROR_BUSY:
                case NRF_ERROR_INVALID_STATE:
                    __LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "Client cannot send\n");
                    break;

                case NRF_ERROR_INVALID_PARAM:
                    /* Publication not enabled for this client. One (or more) of the following is wrong:
                     * - An application key is missing, or there is no application key bound to the model
                     * - The client does not have its publication state set
                     *
                     * It is the provisioner that adds an application key, binds it to the model and sets
                     * the model's publication state.
                     */
                    __LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "Publication not configured for client \n");
                    break;

                default:
                    ERROR_CHECK(status);
                    break;
            }
}

static void app_onoff_server0_set_cb(const app_onoff_server_t * p_server, bool onoff)
{
    __LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "Request From Remote: %d\n", onoff);
    app_onoff_status_publish(&m_onoff_server_0);
#if TQT_CONFIG_SERVER_ROLE == TQT_CONFIG_SERVER_NODE_LOCK
    message_from_remote = true;
    get_new_message_from_remote = onoff;
    //nrf_gpio_pin_set(LOCK_STATUS);
//    tqt_send_state_to_provisioner(onoff);
    if(onoff) {
      nrf_gpio_pin_set(LOCK_STATUS);
    } else {
      nrf_gpio_pin_clear(LOCK_STATUS);
    }
#elif TQT_CONFIG_SERVER_ROLE == TQT_CONFIG_SERVER_NODE_RELAY
    app_onoff_status_publish(&m_onoff_server_0);
    if(onoff) {
      nrf_gpio_pin_set(LOCK_STATUS);
    } else {
      nrf_gpio_pin_clear(LOCK_STATUS);
    }
#endif
}

static void app_onoff_server0_get_cb(const app_onoff_server_t * p_server, bool * p_present_onoff)
{
    *p_present_onoff = hal_led_pin_get(LOCK_STATUS);
}

///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
//                                                           Start:  ADD NEW MODEL: SERVER MODEL + CLIENT MODEL                                                                              //
///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

#if TQT_CONFIG_SERVER_ROLE == TQT_CONFIG_SERVER_NODE_RELAY
    static void app_onoff_server1_set_cb(const app_onoff_server_t * p_server, bool onoff);
    static void app_onoff_server1_get_cb(const app_onoff_server_t * p_server, bool * p_present_onoff);
// tqt edit: m_onoff_server_1 is the sever model of RELAY node to receive message from End Node (Lock) to send forward to Provisioner node
APP_ONOFF_SERVER_DEF(m_onoff_server_1,
                     APP_CONFIG_FORCE_SEGMENTATION,
                     APP_CONFIG_MIC_SIZE,
                     app_onoff_server1_set_cb,
                     app_onoff_server1_get_cb)
    static void app_onoff_server1_set_cb(const app_onoff_server_t * p_server, bool onoff)
{

    __LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "Relay Message\n");
        if(onoff) {
      nrf_gpio_pin_set(STATE_OF_SERVER_LOCK);
    } else {
      nrf_gpio_pin_clear(STATE_OF_SERVER_LOCK);
    }
    app_onoff_status_publish(&m_onoff_server_1);
}

/* Callback for reading the hardware state */
static void app_onoff_server1_get_cb(const app_onoff_server_t * p_server, bool * p_present_onoff)
{
     __LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "app_onoff_server1_get_cb RUN\n");
    //*p_present_onoff = hal_led_pin_get(LOCK_STATUS);
}

static void app_onoff_server2_set_cb(const app_onoff_server_t * p_server, bool onoff);
static void app_onoff_server2_get_cb(const app_onoff_server_t * p_server, bool * p_present_onoff);
// tqt edit: m_onoff_server_2 is the sever model of RELAY node to receive message from Provisioner Node to send forward to End node (Lock)
APP_ONOFF_SERVER_DEF(m_onoff_server_2,
                     APP_CONFIG_FORCE_SEGMENTATION,
                     APP_CONFIG_MIC_SIZE,
                     app_onoff_server2_set_cb,
                     app_onoff_server2_get_cb)
    static void app_onoff_server2_set_cb(const app_onoff_server_t * p_server, bool onoff)
{

    __LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "Relay message from CLOUD number: %d\n",tqt_count_package);
        if(onoff) {
      nrf_gpio_pin_set(REQUEST_FROM_CLOUD);
    } else {
      nrf_gpio_pin_clear(REQUEST_FROM_CLOUD);
    }
    tqt_count_package++;
    app_onoff_status_publish(&m_onoff_server_2);
}

/* Callback for reading the hardware state */
static void app_onoff_server2_get_cb(const app_onoff_server_t * p_server, bool * p_present_onoff)
{
     __LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "app_onoff_server_SP_get_cb RUN\n");
    //*p_present_onoff = hal_led_pin_get(LOCK_STATUS);
}

#elif TQT_CONFIG_SERVER_ROLE == TQT_CONFIG_SERVER_NODE_LOCK
// tqt edit tqt_m_client: is the client model to send request from End Node (Lock) to Provisioner
generic_onoff_client_t tqt_m_client;
static bool      first_blood = false;
static bool      last_state_of_server_node = false;
static void app_gen_onoff_client_publish_interval_cb(access_model_handle_t handle, void * p_self);
static void app_generic_onoff_client_status_cb(const generic_onoff_client_t * p_self,
                                               const access_message_rx_meta_t * p_meta,
                                               const generic_onoff_status_params_t * p_in);
static void app_gen_onoff_client_transaction_status_cb(access_model_handle_t model_handle,
                                                       void * p_args,
                                                       access_reliable_status_t status);

const generic_onoff_client_callbacks_t client_cbs =
{
    .onoff_status_cb = app_generic_onoff_client_status_cb,
    .ack_transaction_status_cb = app_gen_onoff_client_transaction_status_cb,
    .periodic_publish_cb = app_gen_onoff_client_publish_interval_cb
};
