tranminhhuu/KLTN_Source_Git/nrf5SDKforMeshv310src/examples/light_switch/server/src/main.c
/* This callback is called periodically if model is configured for periodic publishing */
static void app_gen_onoff_client_publish_interval_cb(access_model_handle_t handle, void * p_self)
{
     __LOG(LOG_SRC_APP, LOG_LEVEL_WARN, "Publish desired message here.\n");
}

static void app_gen_onoff_client_transaction_status_cb(access_model_handle_t model_handle,
                                                       void * p_args,
                                                       access_reliable_status_t status)
{
    switch(status)
    {
        case ACCESS_RELIABLE_TRANSFER_SUCCESS:
            __LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "Acknowledged transfer success.\n");
            break;

        case ACCESS_RELIABLE_TRANSFER_TIMEOUT:
            hal_led_blink_ms(LEDS_MASK, LED_BLINK_SHORT_INTERVAL_MS, LED_BLINK_CNT_NO_REPLY);
            __LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "Acknowledged transfer timeout.\n");
            break;

        case ACCESS_RELIABLE_TRANSFER_CANCELLED:
            __LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "Acknowledged transfer cancelled.\n");
            break;

        default:
            ERROR_CHECK(NRF_ERROR_INTERNAL);
            break;
    }
}
static void app_generic_onoff_client_status_cb(const generic_onoff_client_t * p_self,
                                               const access_message_rx_meta_t * p_meta,
                                               const generic_onoff_status_params_t * p_in)
{

        __LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "State Feedback\n");

//      if (first_blood == false) {
//          last_state_of_server_node = p_in->present_on_off;
//          __LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "first blood: %d\n",p_in->target_on_off);
//          first_blood = true;
//      } else {
//          if (last_state_of_server_node == p_in->present_on_off) {
//              __LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "Throw\n");
//              return; 
//          } else {
//              last_state_of_server_node = p_in->present_on_off;  
//              __LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "State Feedback: %d\n",p_in->target_on_off);
//          }
//      }
}


// tqt edit: add server model to subscribe to provisioner receive request from cloud
  static void app_onoff_server1_set_cb(const app_onoff_server_t * p_server, bool onoff);
  static void app_onoff_server1_get_cb(const app_onoff_server_t * p_server, bool * p_present_onoff);
// tqt edit: m_onoff_server_1 is the sever model of END NODE to receive message from Provisioner Node (Cloud)
APP_ONOFF_SERVER_DEF(m_onoff_server_1,
                     APP_CONFIG_FORCE_SEGMENTATION,
                     APP_CONFIG_MIC_SIZE,
                     app_onoff_server1_set_cb,
                     app_onoff_server1_get_cb)
static void app_onoff_server1_set_cb(const app_onoff_server_t * p_server, bool onoff)
{
    message_from_cloud = true;
    get_new_message_from_cloud = onoff;
//    __LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "New Request From Cloud To Door: %d ---- Count Package: %d\n", onoff, tqt_count_package);
    app_onoff_status_publish(&m_onoff_server_1);
//    if(onoff) {
//      nrf_gpio_pin_set(REQUEST_FROM_CLOUD);
//      tqt_send_state_to_provisioner(true);
//      door_unlock();
//      tqt_count_package++;
//    } else {
//      tqt_send_state_to_provisioner(false);
//      nrf_gpio_pin_clear(REQUEST_FROM_CLOUD);
//      door_lock();
//      tqt_count_package++;
//    }
}

static void app_onoff_server1_get_cb(const app_onoff_server_t * p_server, bool * p_present_onoff)
{
     __LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "app_onoff_server1_get_cb RUN\n");
}
#endif

///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
//                                                           End:  ADD NEW MODEL: SERVER MODEL + CLIENT MODEL                                                                              //
///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

static void app_model_init(void)
{
    /* Instantiate onoff server on element index APP_ONOFF_ELEMENT_INDEX */
//tqt edit
    ERROR_CHECK(app_onoff_init(&m_onoff_server_0, 0));                  
    //__LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "App OnOff Model Handle: %d\n", m_onoff_server_0.server.model_handle);
    #if TQT_CONFIG_SERVER_ROLE == TQT_CONFIG_SERVER_NODE_RELAY
//tqt edit: This model use for relay server node
     ERROR_CHECK(app_onoff_init(&m_onoff_server_1, 1));                 
     ERROR_CHECK(app_onoff_init(&m_onoff_server_2, 2));
#elif TQT_CONFIG_SERVER_ROLE == TQT_CONFIG_SERVER_NODE_LOCK
//tqt edit: add new client model send request to provisioner
    tqt_m_client.settings.p_callbacks = &client_cbs;
    tqt_m_client.settings.timeout = 0;
    tqt_m_client.settings.force_segmented = APP_CONFIG_FORCE_SEGMENTATION;
    tqt_m_client.settings.transmic_size = APP_CONFIG_MIC_SIZE;
    ERROR_CHECK(generic_onoff_client_init(&tqt_m_client, 1));
//tqt edit: add new server model receive request from provisioner (Cloud)
    ERROR_CHECK(app_onoff_init(&m_onoff_server_1, 2));
#endif
    ERROR_CHECK(app_onoff_init(&server_model_listen_cloud_mesh_stt, TQT_SERVER_MODEL_LISTEN_MESH_STATUS_INDEX));
    __LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "Add Mesh NetWork status model.\n");
}

static void node_reset(void)
{
    __LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "----- Node reset  -----\n");
    hal_led_blink_ms(LEDS_MASK, LED_BLINK_INTERVAL_MS, LED_BLINK_CNT_RESET);
    /* This function may return if there are ongoing flash operations. */
    mesh_stack_device_reset();
}

static void config_server_evt_cb(const config_server_evt_t * p_evt)
{
    if (p_evt->type == CONFIG_SERVER_EVT_NODE_RESET)
    {
        node_reset();
    }
}

static void device_identification_start_cb(uint8_t attention_duration_s)
{
    hal_led_mask_set(LEDS_MASK, false);
    hal_led_blink_ms(BSP_LED_2_MASK  | BSP_LED_3_MASK,
                     LED_BLINK_ATTENTION_INTERVAL_MS,
                     LED_BLINK_ATTENTION_COUNT(attention_duration_s));
}

