tranminhhuu/KLTN_Source_Git/nrf5SDKforMeshv310src/examples/light_switch/server/src/main.c
static void provisioning_aborted_cb(void)
{
    hal_led_blink_stop();
}

static void provisioning_complete_cb(void)
{
    __LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "Successfully provisioned\n");
    nrf_gpio_pin_set(NODE_PROVISIONED);
#if MESH_FEATURE_GATT_ENABLED
    /* Restores the application parameters after switching from the Provisioning
     * service to the Proxy  */
    gap_params_init();
    conn_params_init();
#endif

    dsm_local_unicast_address_t node_address;
    dsm_local_unicast_addresses_get(&node_address);
    __LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "Node Address: 0x%04x \n", node_address.address_start);

    hal_led_blink_stop();
    hal_led_mask_set(LEDS_MASK, LED_MASK_STATE_OFF);
    hal_led_blink_ms(LEDS_MASK, LED_BLINK_INTERVAL_MS, LED_BLINK_CNT_PROV);
}

static void models_init_cb(void)
{
    __LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "Initializing and adding server models\n");
    app_model_init();
}

static void mesh_init(void)
{
#if TQT_CONFIG_SERVER_ROLE == TQT_CONFIG_SERVER_NODE_LOCK
    mesh_stack_init_params_t init_params =
    {
        .core.irq_priority       = NRF_MESH_IRQ_PRIORITY_THREAD,        
        .core.lfclksrc           = DEV_BOARD_LF_CLK_CFG,
        .core.p_uuid             = NULL,
        .models.models_init_cb   = models_init_cb,
        .models.config_server_cb = config_server_evt_cb
    };
    ERROR_CHECK(mesh_stack_init(&init_params, &m_device_provisioned));
#elif TQT_CONFIG_SERVER_ROLE == TQT_CONFIG_SERVER_NODE_RELAY
    mesh_stack_init_params_t init_params =
    {
        .core.irq_priority       = NRF_MESH_IRQ_PRIORITY_LOWEST, 
        .core.lfclksrc           = DEV_BOARD_LF_CLK_CFG,
        .core.p_uuid             = NULL,
        .models.models_init_cb   = models_init_cb,
        .models.config_server_cb = config_server_evt_cb
    };
    ERROR_CHECK(mesh_stack_init(&init_params, &m_device_provisioned));
#endif
}

//adding checkpass
//bool Check_Pass(void){
//      int i = 0;
//      int check_flag = 0;
//      for(i;i < 4; i++){
//        if(input_pass[0] != pass[0]){
//          check_flag = 1;
//      }
//      if(check_flag == 1){
//      return false;
//      }
//      return true;
//}
//adding checkpass

/**
*
*   @brief: Button event handler
*/
void in_pin_handler(nrfx_gpiote_pin_t button_number, nrf_gpiote_polarity_t action)
{
    
    uint32_t status = NRF_SUCCESS;
    generic_onoff_set_params_t set_params;
    model_transition_t transition_params;
    static uint8_t tid = 0;
//    __LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "BUTTON: \n", button_number);
    switch (button_number)
    {
        case BUTTON_3:
        {
//            __LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "Pass: %d%d%d%d\n", input_pass[0], input_pass[1], input_pass[2], input_pass[3]);
////            __LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "Pass model: %d%d%d%d\n", pin_key_map[3][4], pin_key_map[3][1], pin_key_map[3][4], pin_key_map[2][2]);
////            if((input_pass[0] == pin_key_map[3][4]) &&
////            (input_pass[1] == pin_key_map[3][1]) &&
////            (input_pass[2] == pin_key_map[3][4]) &&
////            (input_pass[3] == pin_key_map[2][2])){
//            if(memcmp(input_pass, pass, sizeof(input_pass)) == 0){
//                __LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "Pass OK\n");
//            }else{
//                __LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "not OK\n");
//            }
//                __LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "BUTTON 3\n");
//            door_unlock();
              __LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "Keypad running!");
              Keypad_on = 1;
            break;
        }

        case BUTTON_4:
        {
            __LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "BUTTON 4");
            break;
        }
        /* Initiate node reset */
        case BUTTON_2:
        {
// Test trigger Timer
        __LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "BUTTON 2");
            /* Clear all the states to reset the node. */
            if (mesh_stack_is_device_provisioned())
            {
            #if MESH_FEATURE_GATT_PROXY_ENABLED
                (void) proxy_stop();
            #endif
                mesh_stack_config_clear();
                node_reset();
            }
            else
            {
                __LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "The device is unprovisioned. Resetting has no effect.\n");
            }

//              Keypad_on = 1;
//              door_lock();
// Test trigger Timer
            break;
        }
//        case KEYPAD_ROW_1:
//        {
//            if (nrf_gpio_pin_read(30)==1){
//              input_pass[countKey]= pin_key_map[3][0];
//             // print_pass(countKey+48);
//              countKey ++; 
//              //NRF_LOG_INFO("1604  %d %d %d", 3-i, 0,input_pass[countKey-1]);
//              nrf_delay_ms(50);
//              pin_check=0;
//               __LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "Key 1 from Keypad\n");
//               __LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "Key 1 from Keypad\n");
//               break;
//          }  
//        }

        default:
            break;
    }
}

// Adding keypad S
bool button_is_push(void){
//    __LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "Check button ");
    nrf_gpio_pin_clear(4);//output
    nrf_gpio_pin_clear(3);
    nrf_gpio_pin_clear(2);
    nrf_gpio_pin_clear(31);
    if ((nrf_gpio_pin_read(30)==0) || (nrf_gpio_pin_read(29)==0) || (nrf_gpio_pin_read(2)==0) || (nrf_gpio_pin_read(31)==0)){
      return true;
    }
    return false;
}

void check_row(int i){
//    __LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "Check row button: ");
    nrf_gpio_pin_set(4);//output
    nrf_gpio_pin_set(3);
    nrf_gpio_pin_set(2);
    nrf_gpio_pin_set(31);  
    nrf_delay_ms(5);
    if (i==0){
      nrf_gpio_pin_clear(4);
      nrf_delay_ms(5);
    }
    else if(i==1){
      nrf_gpio_pin_clear(3);
      nrf_delay_ms(5);
    }
    else if(i==2){
      nrf_gpio_pin_clear(2);
      nrf_delay_ms(5);
    }
    else{
      nrf_gpio_pin_clear(31);
      nrf_delay_ms(5);
    }
}

//static void keypad_pin_handler(){	
static void keypad_pin_handler(void * p_context){	
//static void keypad_pin_handler(nrfx_gpiote_pin_t button_number, nrf_gpiote_polarity_t action){	
      //NRF_LOG_INFO("Pin scan");
      //nrf_delay_ms(100);
    //ret_code_t err_code;
    UNUSED_PARAMETER(p_context);
    //__LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "9oooo ");
    if (button_is_push()){
      nrf_delay_ms(10);
      if (button_is_push()){
        for (int i = 0;i<4;i++){
          check_row(i);
          if (nrf_gpio_pin_read(30)==0){
            input_pass[countKey]= pin_key_map[3-i][0];
           // print_pass(countKey+48);
            countKey ++; 
            //NRF_LOG_INFO("1604  %d %d %d", 3-i, 0,input_pass[countKey-1]);
//            nrf_gpio_pin_set(12);
//            nrf_delay_ms(50);
//            nrf_gpio_pin_clear(12);
//            pin_check=0;
            __LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "Pass: %d\n", input_pass[countKey-1]);
          }
          else if (nrf_gpio_pin_read(29)==0){
            input_pass[countKey]= pin_key_map[3-i][1];
           // print_pass(countKey+48);
            countKey ++;
            //NRF_LOG_INFO("1621  %d %d %d", 3-i, 1,input_pass[countKey-1]);
//            nrf_gpio_pin_set(12);
//            nrf_delay_ms(50);
//            nrf_gpio_pin_clear(12);
//            pin_check=0;
             __LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "Pass: %d\n", input_pass[countKey-1]);
          }
          else if (nrf_gpio_pin_read(28)==0){
             input_pass[countKey]= pin_key_map[3-i][2];
            // print_pass(countKey+48);
             countKey ++;
             //NRF_LOG_INFO("1628  %d %d %d", 3-i, 2,input_pass[countKey-1]);
//             nrf_gpio_pin_set(12);
//             nrf_delay_ms(50);
//             nrf_gpio_pin_clear(12);
//             pin_check=0;
             __LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "Pass: %d\n", input_pass[countKey-1]);
          }
          else if (nrf_gpio_pin_read(25)==0){
              input_pass[countKey]= pin_key_map[3-i][3];
            //  print_pass(countKey+48);
              countKey ++;
              //NRF_LOG_INFO("1635  %d %d %d", 3-i, 3,input_pass[countKey-1]);
//              nrf_gpio_pin_set(12);
//              nrf_delay_ms(50);
//              nrf_gpio_pin_clear(12);
//              pin_check=0;
             __LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "Pass: %d\n", input_pass[countKey-1]);
          }  
          else{
//            nrf_delay_ms(50);
          }
//          __LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "Input pass: ", input_pass);
        }
      }
   }
   if (countKey==4){
        app_timer_stop(pin);
        input_pass[countKey]='\0';
        countKey = 0;
        Keypad_on = 0;
        input_done = 1;
        __LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "OK pass!\n");
        }
 }
// Adding keypad E

