tranminhhuu/KLTN_Source_Git/nrf5SDKforMeshv310src/examples/light_switch/server/src/main.c
void keypad_init(){
  nrf_gpio_cfg_output(4);
  nrf_gpio_cfg_output(3);
  nrf_gpio_cfg_output(2);
  nrf_gpio_cfg_output(31);

  nrf_gpio_cfg_output(12);

  nrf_gpio_cfg_input(30,GPIO_PIN_CNF_PULL_Pullup);
  nrf_gpio_cfg_input(29,GPIO_PIN_CNF_PULL_Pullup);
  nrf_gpio_cfg_input(28,GPIO_PIN_CNF_PULL_Pullup);
  nrf_gpio_cfg_input(25,GPIO_PIN_CNF_PULL_Pullup);
  nrf_gpio_pin_clear(4);
  nrf_gpio_pin_clear(3);
  nrf_gpio_pin_clear(2);
  nrf_gpio_pin_clear(31);
  __LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "Keypad OK\n");
}

static void tqt_gpiote_button_ext_init(nrfx_gpiote_pin_t pin_cfg)
{

    nrfx_gpiote_init();
    nrfx_gpiote_in_config_t in_config = NRFX_GPIOTE_CONFIG_IN_SENSE_HITOLO(true);                   //NRFX_GPIOTE_CONFIG_IN_SENSE_TOGGLE ====> NRFX_GPIOTE_CONFIG_IN_SENSE_HITOLO
    in_config.pull = NRF_GPIO_PIN_PULLUP;

    nrfx_gpiote_in_init(pin_cfg, &in_config, in_pin_handler);
// adding Keypad
//    nrfx_gpiote_in_init(pin_cfg, &in_config, keypad_pin_handler);
// adding Keypad
    nrfx_gpiote_in_event_enable(pin_cfg, false);
    nrfx_gpiote_in_event_disable(pin_cfg);
    nrfx_gpiote_in_event_enable(pin_cfg, true);
}

void tqt_init_led()
{
    nrf_gpio_pin_clear(LED_1);
    nrf_gpio_pin_clear(LED_2);
    nrf_gpio_pin_clear(LED_3);
    nrf_gpio_pin_clear(LED_4);
}

//void test_handler(void * p_context)
//{  
//                    bsp_board_led_invert(BSP_BOARD_LED_1);
//}

static void initialize(void)
{
    uint32_t err_code;
    __LOG_INIT(LOG_SRC_APP | LOG_SRC_ACCESS | LOG_SRC_BEARER, LOG_LEVEL_INFO, LOG_CALLBACK_DEFAULT);
    __LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "----- BLE Mesh Light Switch Server Demo -----\n");
    ERROR_CHECK(app_timer_init());
//    ERROR_CHECK( app_timer_create(&pin, APP_TIMER_MODE_REPEATED, keypad_pin_handler));
//   err_code = app_timer_create(&pin, APP_TIMER_MODE_REPEATED, keypad_pin_handler);
//    app_timer_create(&pin, APP_TIMER_MODE_REPEATED, test_handler);
//    err_code = app_timer_start(pin, 50000, test_handler);
    app_timer_create(&pin, APP_TIMER_MODE_REPEATED, keypad_pin_handler);
//    err_code = app_timer_start(pin, 30000, keypad_pin_handler);
//    APP_ERROR_CHECK(err_code);
  //ERROR_CHECK( app_timer_start(pin, PIN_TIMER, NULL));
   

//    app_simple_timer_start(1, keypad_pin_handler, 50000 , NULL);
    //app_simple_timer_start(1, keypad_pin_handler, 50000, NULL);
#if BUTTON_BOARD
    ERROR_CHECK(hal_buttons_init(button_event_handler));
#endif
    bsp_board_init(BSP_INIT_LEDS);
    tqt_init_led();
    tqt_gpiote_button_ext_init(BUTTON_1);
    tqt_gpiote_button_ext_init(BUTTON_3);
    tqt_gpiote_button_ext_init(BUTTON_4);
    tqt_gpiote_button_ext_init(BUTTON_2);
//    tqt_gpiote_button_ext_init(KEYPAD_ROW_1);
    ble_stack_init();
    #if MESH_FEATURE_GATT_ENABLED
    gap_params_init();
    conn_params_init();
    #endif
    /* Mesh Init */
    mesh_init();
}

static void start(void)
{
    //rtt_input_enable(app_rtt_input_handler, RTT_INPUT_POLL_PERIOD_MS);

    if (!m_device_provisioned)
    {
        static const uint8_t static_auth_data[NRF_MESH_KEY_SIZE] = STATIC_AUTH_DATA;
        mesh_provisionee_start_params_t prov_start_params =
        {
            .p_static_data    = static_auth_data,
            .prov_complete_cb = provisioning_complete_cb,
            .prov_device_identification_start_cb = device_identification_start_cb,
            .prov_device_identification_stop_cb = NULL,
            .prov_abort_cb = provisioning_aborted_cb,
            .p_device_uri = EX_URI_LS_SERVER
        };
        ERROR_CHECK(mesh_provisionee_prov_start(&prov_start_params));
    }

    mesh_app_uuid_print(nrf_mesh_configure_device_uuid_get());

    ERROR_CHECK(mesh_stack_start());

    hal_led_mask_set(LEDS_MASK, LED_MASK_STATE_OFF);
    hal_led_blink_ms(LEDS_MASK, LED_BLINK_INTERVAL_MS, LED_BLINK_CNT_START);
}

void check_ID() {
    if((strstr(ID_of_card,"ID:494AAE8E")) || (strstr(ID_of_card,"ID:50E7891E"))) {
        door_unlock();
        tqt_send_state_to_provisioner(true);
        memset(ID_of_card,'\0',sizeof(ID_of_card));
  } else {
        door_lock();
        tqt_send_state_to_provisioner(false);
        memset(ID_of_card,'\0',sizeof(ID_of_card));
  }
}

int main(void)
{ 
    uint32_t err_code;
    initialize();
    keypad_init();
    start();
#if TQT_CONFIG_SERVER_ROLE == TQT_CONFIG_SERVER_NODE_LOCK
    APP_SCHED_INIT(APP_SCHED_EVENT_SIZE, APP_SCHED_QUEUE_SIZE);
    tqt_init_uart();
    __LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "Uart OK\n");
    init_unlock_pin();
#endif
    for (;;)
    { 
#if TQT_CONFIG_SERVER_ROLE == TQT_CONFIG_SERVER_NODE_LOCK
      app_sched_execute();
      bool done = nrf_mesh_process();
      if (done){
// Keypad Function
//          keypad_pin_handler();
          if(Keypad_on == 1){    
              err_code = app_timer_start(pin, 30000, keypad_pin_handler);
              APP_ERROR_CHECK(err_code);
          }
          if( input_done == 1){
            __LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "Pass: %d%d%d%d\n", input_pass[0], input_pass[1], input_pass[2], input_pass[3]);
//            __LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "Pass model: %d%d%d%d\n", pin_key_map[3][4], pin_key_map[3][1], pin_key_map[3][4], pin_key_map[2][2]);
//            if((input_pass[0] == pin_key_map[3][4]) &&
//            (input_pass[1] == pin_key_map[3][1]) &&
//            (input_pass[2] == pin_key_map[3][4]) &&
//            (input_pass[3] == pin_key_map[2][2])){
            if(memcmp(input_pass, pass, sizeof(input_pass)) == 0){
                __LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "Pass OK\n");
                input_done = 0;
                 door_unlock();
                 tqt_send_state_to_provisioner(true);
            }else{
                __LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "Pass not OK\n");
                input_done = 0;
                 door_lock();
                 tqt_send_state_to_provisioner(false);
            }
//                __LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "BUTTON 3\n");
          }

//          if(RECEIVE_RFID_DATA_OK == true) {
//            if(strstr(ID_of_card,"+TAG:1")) {
//                  tqt_send_string(READ_ID);
//                  __LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "AT COMMAND\n");
//                  memset(ID_of_card,'\0',sizeof(ID_of_card));
//                  RECEIVE_RFID_DATA_OK = false;
//                  continue;
//            } else if (strstr(ID_of_card,"+TAG:0")) {
//                  __LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "TAG 0\n");
//                  memset(ID_of_card,'\0',sizeof(ID_of_card));
//                  RECEIVE_RFID_DATA_OK = false;
//                  continue;
//            } else if((strstr(ID_of_card,"ID:494AAE8E")) || (strstr(ID_of_card,"ID:50E7891E"))) {
//                  door_unlock();
//                  tqt_send_state_to_provisioner(true);
//                  __LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "OPEN\n");
//                  memset(ID_of_card,'\0',sizeof(ID_of_card));
//                  RECEIVE_RFID_DATA_OK = false;
//                  continue;
//            } else {
//                  door_lock();
//                  tqt_send_state_to_provisioner(false);
//                  __LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "CLOSE\n");
//                  memset(ID_of_card,'\0',sizeof(ID_of_card));
//                  RECEIVE_RFID_DATA_OK = false;
//                  continue;
//            }
// Keypad Function
          } else if (message_from_cloud == true) {
              __LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "New Request From Cloud To Door: %d ---- Count Package: %d\n", get_new_message_from_cloud, tqt_count_package);
              if(get_new_message_from_cloud) {
                //nrf_gpio_pin_set(REQUEST_FROM_CLOUD);
                nrf_gpio_pin_set(UNLOCK_DOOR);
                nrf_gpio_pin_set(LOCK_STATUS);
              } else {
                //nrf_gpio_pin_clear(REQUEST_FROM_CLOUD);
                nrf_gpio_pin_clear(UNLOCK_DOOR);
                nrf_gpio_pin_clear(LOCK_STATUS);
              }
              tqt_send_state_to_provisioner(get_new_message_from_cloud);
              tqt_count_package++;
              message_from_cloud = false;
              continue;
          } else if (message_from_remote == true) {
          __LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "New Request From Remote\n");
              tqt_send_state_to_provisioner(get_new_message_from_remote);
              if(get_new_message_from_remote == true) {
                nrf_gpio_pin_set(UNLOCK_DOOR);
                nrf_gpio_pin_set(LOCK_STATUS);
              } else {
                nrf_gpio_pin_clear(UNLOCK_DOOR);
                nrf_gpio_pin_clear(LOCK_STATUS);
              }
              message_from_remote = false;
              continue;
          } else {
              continue;
          }
        (void)sd_app_evt_wait();
     }
#elif TQT_CONFIG_SERVER_ROLE == TQT_CONFIG_SERVER_NODE_RELAY
     (void)sd_app_evt_wait();
#endif
        (void)sd_app_evt_wait();
}